Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ཡུལ་འཁོར་བཟང་། །རིན་ཆེན་མཆོག་མ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །དགའ་བའི་དབང་ཕྱུག་ལེགས་དགའ་རིམ་གྲོ་པ། །
en: “The family of this victor will be brahmin and his light will extend ten leagues. Land of Excellence will be his father And Supreme Jewel his mother. Lord of Joy will be his son and Excellent Joy his attendant.

source: འོད་བྱེད་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Radiant will be the scholar

source: འདུས་པ་དག་ནི་ལན་གྲངས་བརྒྱད་ཅུ་སྟེ། །
en: There will be eighty congregations,

source: ཀུན་ལའང་སེམས་ནི་རྣམ་པར་གྲོལ་བ་ཀུན། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་རྩ་གཉིས་གཉིས། །
en: Each of them gathering “Nine hundred twenty million beings of liberated mind.

source: དེ་དག་ཚེ་ཚད་ལོ་གྲངས་བརྒྱ་ཡང་ཡིན། །
en: Their lifespan will be one hundred years,

source: ཟད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་ཉི་ཤུ་གསུམ་དུ་གནས། །
en: And after this victor has accomplished exhaustion His sacred Dharma will remain for twenty-three thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་བྱེ་སྟོང་བདུན་ཅུ་དྲུག །རིན་ཆེན་བརྒྱ་ཡི་དྲ་བས་རྣམ་པར་སྤྲས། །
en: “His relics will be contained in seven hundred sixty billion stūpas Adorned with nets of a hundred different jewels.

source: འཇིག་རྟེན་མགོན་པོ་ཀུན་ཏུ་རྒྱལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བདེན་པས་བརྒྱན་ཅེས་བྱ། །
en: The protector of the world, Saṃjaya, Will be born in a place called Adorned with Truth.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་བཅུ་གཉིས་ཡབ་ནི་རྒྱ་མཚོ་ཡིན། །གཟི་བརྗིད་བདག་མོ་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །བསམ་གཏན་དགའ་བ་ལྷ་ནི་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend one hundred twenty million leagues. Ocean will be his father, and Lady of Splendor will be this victor’s mother. Joy in Concentration will be his son and Deity his attendant.

source: དགྲ་བཅོམ་དག་གིས་བསྟོད་པ་མཁས་པ་སྟེ། །
en: “Praised by the Worthy will be the scholar

source: རྒོལ་བ་རབ་ཏུ་འཇོམས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Destroyer of Attacks the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བརྒྱད་ཡིན་ཏེ། །འདུས་པ་ཀུན་ལའང་ང་རྒྱལ་རྒྱལ་མཚན་དག །སྤངས་པ་ཐམས་ཅད་བྱེ་བ་ཕྲག་སྟོང་སྟོང་། །
en: There will be eight congregations, Each of them gathering ten billion “Who have abandoned the banner of pride.

source: མི་ཡི་མཆོག་རབ་དག་གི་དམ་ཆོས་དག །ལོ་གྲངས་བྱེ་བ་ཚང་བར་གནས་པར་འགྱུར། །
en: And the sacred Dharma of this supreme human Will remain for ten million years.

source: མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་ཚང་བ་ལ། །དངུལ་གྱིས་སྤྲས་ཤིང་མུ་ཏིག་རབ་ཏུ་སྦྱངས། །
en: “There will be one billion stūpas Decorated with silver and pure pearls.

source: དེ་བཞིན་གཤེགས་པ་དགའ་བ་བཀོད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྟག་ཏུ་མཐོང་ཞེས་བྱ། །
en: The thus-gone Rativyūha Will be born in a place called Seen Always.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་ཡབ་ནི་འཁྲུག་པ་མེད། །སྐད་སྙན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya and his light will extend ten million leagues. Unperturbed will be his father, And Beautiful Voice will be this victor’s mother.

source: སྲས་པོ་འཇམ་དབྱངས་སྐར་མ་རིམ་གྲོ་པ། །
en: Gentle Melody will be his son and Star his attendant.

source: འགྲོ་བ་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Joyous Movement will be the scholar

source: ཐུབ་པ་མཆོད་འདོད་ཅེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Wish to Worship the Capable the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་གཉིས་ཡིན་ཏེ། །ཀུན་ལའང་དགྲ་བཅོམ་འཁྲུག་མེད་གནས་པ་ཀུན། །ཁྲི་ཕྲག་ཉི་ཤུ་རྩ་ནི་གཉིས་གཉིས་ཡོད། །
en: There will be two congregations, Each of them gathering “Two hundred twenty thousand unperturbed worthy ones.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་སུམ་སྟོང་ཡིན། །
en: The lifespan of humans will be three thousand years,

source: ལུས་པ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་གཉིས་བར་དུ་གནས། །
en: And when this teacher has left nothing behind His sacred Dharma will remain for twelve thousand years.

source: དེ་ཡི་ཚེ་ན་རྒྱལ་བའི་མཆོད་རྟེན་ནི། །དཔག་ཚད་བཅུ་པའི་ཚད་ཙམ་གཅིག་འབྱུང་འགྱུར། །
en: “The single stūpa of that time’s victor Will measure ten leagues.

source: དེ་བཞིན་གཤེགས་པ་སྟེགས་ནི་མཛད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བདེ་བ་ཅན་ཞེས་བྱ། །
en: The thus-gone Tīrthakara Will be born in a place called Blissful.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་ཅུ་ཡབ་ནི་མཐུ་རྩལ་ཡིན། །ཡིད་གཉིས་སྤོང་བ་རྒྱལ་བའི་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya and his light will extend thirty leagues. Power will be his father, And Abandoning Doubts will be this victor’s mother.

source: སྲས་པོ་ལྗོན་མཆོག་ཐབས་ལྡན་རིམ་གྲོ་པ། །
en: Supreme Tree will be his son and Skillful his attendant.

source: ས་འཛིན་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: “Earth Holder will be the scholar

source: རི་བོ་སྒུལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Mountain Shaker the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །འདུས་པ་ཀུན་ལའང་སྲེད་པའི་རྒྱ་མཚོ་ལས། །རྒལ་གྱུར་བྱེ་བ་ཕྲག་ནི་དགུ་དགུ་ཡོད། །
en: There will be sixty-six congregations, Each of them gathering ninety million “Who have crossed the ocean of craving.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་དགུ། །
en: The lifespan of humans will be ninety-nine thousand years,

source: ཟད་མཐར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སུམ་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And when this teacher has accomplished exhaustion His sacred Dharma will remain for thirty-six thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བཟང་པོ་དག །བྱེ་བ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་འབྱུང་། །
en: “His relics will be abundant, and the excellent stūpas Will number two hundred twenty billion.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་ཀྱི་གླང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྤོས་གསལ་ཞེས་ཀྱང་བྱ། །
en: The thus-gone Gandhahastin Will be born in a place called Clear Fragrance.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་ཕྲག་གསུམ་ལག་བཟངས་ཡབ། །ས་ཡི་བདག་མོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend thirty million leagues. Excellent Hand will be his father, and Lady of the Land will be this victor’s mother.

source: སྲས་པོ་ཤུག་པ་དྲག་ཤུལ་རིམ་གྲོ་པ། །
en: Sharing will be his son and Fierce his attendant.

source: ངེས་པ་བརྟན་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Firm Certainty will be the scholar

source: གླང་པོའི་ལྟ་སྟངས་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Elephant Gaze the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་འདམ་བརྒལ་གཏི་མུག་བྲལ་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: There will be thirty-six congregations, Each of them gathering two hundred forty million “Who have crossed the swamp and are free from ignorance.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བཅྭ་ལྔ་ཡིན། །
en: The lifespan of humans will be fifteen thousand years,

source: ལུས་པ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུར་གནས། །
en: And when this teacher has left nothing behind His sacred Dharma will remain for ninety-nine thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་བརྒྱ་ཕྲག་བདུན་ཅུ་འབྱུང་། །
en: “The relics of this victor will be abundant, Enshrined in seventy billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་འོད་འཕྲོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བསོད་ནམས་ལྡན་ཞེས་བྱ། །
en: The thus-gone Arciṣmati Will be born in a place called Endowed with Merit.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །ཞིང་རྣམས་ཁྱབ་ལྡན་ཡབ་ནི་འོད་བཟངས་ཡིན། །དཔལ་གཟི་མ་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be brahmin, And his light will permeate throughout all realms. Excellent Light will be his father and Glorious Splendor his mother.

source: སྲས་པོ་གཟི་སྡུག་གྲགས་པ་རིམ་གྲོ་པ། །
en: Attractive Splendor will be his son and Fame his attendant.

source: ཡོན་ཏན་བརྒྱན་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Adorned with Qualities will be the scholar

source: སྲིད་པ་སྐྲག་པར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Terrifier of Existence the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཁྲི་ཕྲག་བཞི་ཡིན་ཏེ། །ཀུན་ལའང་རྣམ་ཐར་བརྒྱད་ལ་གནས་གྱུར་པ། །བྱེ་བ་བརྒྱ་ཕྲག་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be forty thousand congregations, Each of them gathering thirty billion “Who abide within the eight liberations.

source: རྒྱལ་བའི་སྐུ་ཚེ་ལོ་གྲངས་བརྒྱ་ཡང་ཡིན། །
en: The lifespan of this victor will be one hundred years,

source: མྱ་ངན་འདས་ནས་འགྲོ་ལ་ཕན་པའི་ཕྱིར། །དམ་ཆོས་ལོ་གྲངས་སྟོང་གི་བར་དུ་གནས། །
en: And once he has attained nirvāṇa his sacred Dharma will, To the benefit of beings, remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག །དཔག་ཚད་བདུན་ཅུ་པ་སྟེ་རྒྱལ་མཚན་བརྒྱན། །
en: “The relics of this victor will remain in a single collection and there will be a single stūpa, Measuring seventy leagues and adorned with banners.

source: དེ་བཞིན་གཤེགས་པ་རི་བོའི་རྒྱལ་མཚན་གྱི། །སྐྱེ་ཡུལ་མཆོད་རྟེན་རྨད་དུ་བྱུང་ཞེས་བྱ། །
en: The thus-gone Merudhvaja Will be born in a place called Wondrous Stūpa.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་ཤེད་སྐྱེས་ཡིན། །ཐ་སྤངས་མ་ཞེས་བྱ་བ་རྡུལ་བྲལ་ཡུམ། །
en: “His family will be brahmin, And his light will extend twenty-two leagues. Human will be his father and Abandoner of Anger will be his immaculate mother.

source: སྲས་པོ་ལྷ་དགའ་སྐར་རྒྱལ་རིམ་གྲོ་པ། །
en: Divine Joy will be his son and Star King his attendant.

source: ཐོས་པ་རྒྱ་མཚོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Ocean of Learning will be the scholar

source: རྒོལ་བ་རྣམ་པར་འཇོམས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Destroyer of Attacks the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་ཏིང་འཛིན་ཞི་བ་རིམ་བསྒོམས་པ། །དགྲ་བཅོམ་འཁྲུག་མེད་བྱེ་བ་བྱེ་བ་ཡོད། །
en: There will be sixty-six congregations, Each of them gathering ten million unshakable worthy ones “Who have cultivated the levels of peaceful absorption.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་ཡང་ཡིན། །
en: The lifespan of humans will be ten thousand years,

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་ནི་ཚང་བར་གནས། །
en: And when the teacher has departed in peace his sacred Dharma Will remain complete for ten thousand years.

source: མཆོད་རྟེན་བཟང་པོ་བྱེ་བ་ཕྲག་གསུམ་སྟེ། །མེ་ཏོག་བ་དན་རྒྱལ་མཚན་མཆོག་གིས་བརྒྱན། །
en: “There will be thirty million fine stūpas, Adorned with supreme flowers, emblems, and banners.

source: བདེ་བར་གཤེགས་པ་རིན་ཆེན་སྤོས་བཟངས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་སྤོས་ཀྱིས་བརྒྱན་ཅེས་བྱ། །
en: The well-gone Sugandha Will be born in a place called Incense Ornament.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་བརྒྱད་ཅུ་ཡབ་ནི་ལེགས་ཡིད་གཞུངས། །སྤོས་ཀྱི་མཆོད་རྟེན་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend eight hundred million leagues. Fine and Noble Mind will be his father and Incense Stūpa will be this victorious one’s mother.

source: སྲས་པོ་ནོར་སྲེད་དགའ་བ་རིམ་གྲོ་པ། །
en: Wealth Lover will be his son and Joy his attendant.

source: རབ་ཞི་མཆོག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Supreme Peace will be the scholar

source: མཆོད་རྟེན་མཆོག་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Stūpa the one of miracles.

source: འཇིག་རྟེན་གསུམ་ལ་མ་ཞེན་མཚུངས་སྨྲ་ལ། །ཆགས་པ་མེད་པར་གྱུར་པ་སྡིག་སྦྱངས་པ། །འདུས་པ་དག་ནི་མཐའ་ཡང་ཡས་པར་འགྱུར། །
en: Those who are free from attachment to the three realms and teach accordingly, Who are beyond desire and have purified unwholesomeness, “Will gather in congregations beyond count.

source: མི་ཚེ་ལོ་གྲངས་ས་ཡ་ཕྲག་གསུམ་ཡིན། །
en: The lifespan of humans will be three million years,

source: མགོན་པོ་མཆོག་མ་མྱ་ངན་འདས་ནས་ཀྱང་། །མགོན་པོ་མཆོག་མའི་དམ་ཆོས་གནས་པར་འགྱུར། །
en: And after the supreme protector has attained nirvāṇa His sacred Dharma will endure.

source: མཆོད་རྟེན་དག་གི་གྲངས་ནི་བརྒྱད་ཁྲི་སྟེ། །གཞན་ཡང་བཞི་སྟོང་གསེར་གྱི་རྒྱལ་མཚན་ཅན། །
en: “There will be eighty thousand stūpas Along with four thousand that are endowed with golden banners.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་བརྟན་ཞེས་བྱ་བའི། །སྐྱེ་བའི་ཡུལ་ནི་དྲག་ཤུལ་འོད་ཅེས་བྱ། །
en: The thus-gone Dṛḍhadharma Will be born in a place called Fierce Light.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་དཔག་ཚད། །ཁྲི་ཕྲག་བཅུ་ཡོད་ཡབ་ནི་ཡང་དག་གཟིགས། །ཤིན་ཏུ་ཡང་དག་གཟིགས་མ་རྒྱལ་ཡུམ་སྲས། །བསོད་ནམས་བཟང་པོ་གཟི་བཟངས་རིམ་གྲོ་པ། །
en: “This victor’s family will be brahmin And his light will extend one hundred thousand leagues. Seeing Correctly will be his father and Seeing Completely Correctly will be this victorious one’s mother. Excellent Merit will be his son and Exquisite Splendor his attendant.

source: བརྟུལ་ཞུགས་མཆོད་རྟེན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Stūpa for Yogic Discipline will be the scholar

source: ཤེས་རབ་རྣམ་པར་ངེས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Certain Insight the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་བཅུ་གཅིག་སྟེ། །ཀུན་ལའང་འཁྲུག་པ་མེད་པར་གནས་གྱུར་ཀུན། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be eleven congregations, Each of them gathering seven hundred twenty million “Who have become unshakable.

source: མི་ཚེ་ལོ་གྲངས་འབུམ་ཕྲག་གཉིས་ཀྱང་ཡིན། །
en: The lifespan of humans will be two hundred thousand years,

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཅུའི་བར་དུ་གནས། །
en: And after this unparalleled one has attained nirvāṇa His sacred Dharma will remain for eighty years.

source: མཆོད་རྟེན་བཟང་པོ་བྱེ་བ་བདུན་ཅུ་དྲུག ། ཁོར་ཡུག་རིན་ཆེན་རྒྱལ་མཚན་དག་གིས་བརྒྱན། །
en: “The excellent stūpas will number seven hundred sixty million And their surroundings will be adorned with jewels and banners.

source: སངས་རྒྱས་གཟི་བརྗིད་དྲག་ཤུལ་ཅན་གྱི་ནི། །སྐྱེ་ཡུལ་གཟི་བརྗིད་མ་སྨད་པ་ཞེས་བྱ། །
en: The thus-gone Ugratejas Will be born in a place called Irreproachable Splendor.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བྱེ་བ་ཡབ་ནི་ལག་དབང་ཡིན། །སྤྲིན་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend ten million leagues. Masterful Hand will be his father and Endowed with Clouds will be this victorious one’s mother.

source: སྲས་པོ་རྣམ་ངེས་དཔའ་བོ་རིམ་གྲོ་པ། །
en: Certainty will be his son and Hero his attendant.

source: སྐྱེ་བ་ཟད་ཅེས་བྱ་བ་ཤེས་ཅན་ཏེ། །
en: “Exhaustion of Birth will be the one of knowledge

source: ཞིང་རྣམས་གཡོ་བར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Shaker of the Realms the one of miracles.

source: འདུས་པ་ལན་གྲངས་ལྔ་སྟེ་ཀུན་ལ་ཡང་། །འགྲོ་དང་སྲིད་མཐའི་ཕ་རོལ་ཕྱིན་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་རེ་རེ་ཡོད། །
en: There will be five consecutive congregations, Each of them gathering seven hundred million “Who have transcended the world and gone beyond existence.

source: རྡུལ་བྲལ་སྐུ་ཚེ་ལོ་གྲངས་ཉིས་བརྒྱ་ཡིན། །
en: The lifespan of this immaculate one will be two hundred years,

source: འཇིག་རྟེན་ཕན་ཕྱིར་ཐུབ་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་གཉིས་ཀྱི་བར་དུ་གནས། །
en: And for the benefit of the world his sacred Dharma Will remain for two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག །དཔག་ཚད་དྲུག་ཅུ་པ་སྟེ་རྒྱན་གྱིས་བརྒྱན། །
en: “The relics of this victor will remain in one collection And the single, jewel-studded stūpa will measure sixty leagues.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་ནོར་བུ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་པད་མ་དཀར་ཞེས་བྱ། །
en: The thus-gone Maṇidharman Will be born in a place called White Lotus.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་གཉིས་ཡོད་ཡབ་ནི་ལེགས་དགའ་ཡིན། །དགའ་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend twenty-two leagues. Excellent Joy will be his father and Supreme Joy will be this victorious one’s mother.

source: སྲས་པོ་ཤེས་དགའ་ཚངས་བཟངས་རིམ་གྲོ་པ། །
en: Joyous Knowledge will be his son and Excellent Brahmā his attendant.

source: མཉམ་པར་སེམས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Equanimous Mind will be the scholar

source: འཇིག་རྟེན་འོད་བྱེད་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Illuminator of the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་རྩ་དྲུག་སྟེ། །ཀུན་ལའང་གཏི་མུག་མ་རིག་མུན་བཅོམ་པ། །འགོག་པ་ཐོབ་པ་བརྒྱད་ཅུ་བརྒྱད་ཅུ་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering eighty beings “Who have defeated dullness and ignorance and attained cessation.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་གི་བར་དུ་གནས། །
en: And after this incomparable one has attained nirvāṇa His sacred Dharma will remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོ་སྟོང་ཕྲག་སུམ་ཅུ་དྲུག །
en: “The relics of this victor will be abundant, And there will be thirty-sixty thousand fine stūpas.

source: འཇིག་རྟེན་མགོན་པོ་བཟང་པོ་བྱིན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་པད་མའི་ཏོག་ཅེས་བྱ། །
en: The world protector Bhadradatta Will be born in a place called Lotus Crest.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་གཉིས་ཡབ་ནི་ཕུང་པོ་བཟང་། །ཉི་མའི་རྒྱུད་ཅེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “His family will be kṣatriya, And his light will extend twelve leagues. Heap of Excellence will be his father and Sun Continuum his mother.

source: སྲས་པོ་ཚངས་དགའ་གྲུབ་པ་རིམ་གྲོ་པ། །
en: Brahmā Joy will be his son and Accomplishment his attendant.

source: ལྷ་ཡིས་མཆོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Worshiped by Gods will be the scholar

source: གསལ་བ་གཏི་མུག་མེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Clarity Free from Dullness the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་སུམ་ཅུ་སྟེ། །འདུས་པ་ཀུན་ལའང་རྒྱལ་སྲས་ཐམས་ཅད་དག །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: There will be thirty consecutive congregations, Each of them gathering seven hundred thirty million “Sons of the victorious ones.

source: སྐུ་ཚེ་ལོ་གྲངས་འབུམ་དུ་ཚང་བར་འགྱུར། །
en: His lifespan will be one hundred thousand years,

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བདུན་ཅུའི་བར་དུ་གནས། །
en: And after this incomparable one has attained nirvāṇa His sacred Dharma will remain for seventy years.

source: བདེ་བར་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བཞི་ཞིག་འབྱུང་། །
en: “Subsequent to this well-gone one’s nirvāṇa His relics will be abundant, and there will be four stūpas.

source: མི་ཡི་འདྲེན་པ་བདེ་གཤེགས་ཟླ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གཟི་བརྗིད་སྤྲུལ་ཅེས་བྱ། །
en: The well-gone guide of humanity, Candra, Will be born in a place called Splendid Creation.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་ཡོད་ཡབ་ནི་ཏོག་བཟངས་ཡིན། །བཟང་ལྡན་མ་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །རྩི་སྨན་ཡན་ལག་མཉམ་པ་རིམ་གྲོ་པ། །
en: “This victor will be of kṣatriya family, And his light will extend eight leagues. Excellent Crest will be his father, and Endowed with Excellence will be this victor’s mother. Medicine will be his son and Even Limbs his attendant.

source: ཡོན་ཏན་ཚོགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Gathering of Qualities will be the scholar

source: མངོན་པར་འཕགས་པའི་ལྷ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Superior God the one of miracles.

source: དྲང་སྲོང་ཆེན་པོའི་སྲས་པོ་ཆགས་མེད་པ། །སེམས་ཞི་རི་དང་མཚུངས་པ་ཐམས་ཅད་དག །འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་རྩ་དྲུག་འདུས། །
en: There will be sixty-six consecutive congregations Of this great sage’s detached children, “Whose minds are serene like mountains.

source: མི་ཚེ་ལོ་གྲངས་ཉི་ཤུ་རྩ་ཡང་གཉིས། །
en: The lifespan of humans will be twenty-two years,

source: གྲགས་པ་མཐའ་ཡས་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་བརྒྱ་ཚང་བའི་བར་དུ་གནས། །
en: And the sacred Dharma of this teacher of infinite fame Will remain complete for three hundred years.

source: རྒྱལ་བའི་མཆོད་རྟེན་བཟང་པོ་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་ཀུན་ཏུ་མཛེས་པ་ཡིན། །
en: “There will be a single fine stūpa of this victor, Measuring eight leagues of beauty.

source: བདེ་བར་གཤེགས་པ་ཚངས་པའི་དབྱངས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་དགའ་བའི་དབྱངས་ཞེས་བྱ། །
en: The well-gone Brahmasvara Will be born in a place called Melody of Joy.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ན་ཚོད་བཟང་། །ལྷ་དགའ་ཞེས་ནི་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: “The family of this victor will be brahmin, And his light will extend nine leagues. Excellent Youth will be his father and Divine Joy his mother.

source: སྲས་པོ་དགའ་བོ་དུལ་བ་རིམ་གྲོ་པ། །
en: Joyous will be his son and Trained his attendant.

source: ཡོན་ཏན་རྒྱ་མཚོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Ocean of Qualities will be the scholar

source: ཡེ་ཤེས་རྣམ་པར་འཕྲུལ་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Miraculous Wisdom Display the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐ་བ་མེད་ཅིང་ཞི་དུལ་དགའ་བ་པོ། །བསམ་གཏན་པ་ནི་བྱེ་བ་བྱེ་བ་ཡོད། །
en: There will be eighty consecutive congregations, Each gathering ten million joyous meditators, “Free from anger, peaceful, and gentle.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་དྲུག་ཡིན། །
en: The lifespan of humans will be sixteen thousand years,

source: དམ་ཆོས་ལོ་གྲངས་དག་ནི་བརྒྱད་ཁྲིར་གནས། །
en: And the sacred Dharma will remain for eighty thousand.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་གྲངས་ནི་བརྒྱད་ཁྲི་ཚང་བ་སྟེ། །རིན་ཆེན་རྒྱལ་མཚན་དྲ་བ་དག་གིས་གཡོགས། །
en: The relics of this victor will be abundant, “And there will be eighty thousand stūpas, Adorned with banners and draped with nets.

source: དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ཟླ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྟག་ཏུ་མཐོང་ཞེས་བྱ། །
en: The thus-gone Siṃhacandra Will be born in a place called Seen Always.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་གཉིས་ཡོད་ཡབ་ནི་ལེགས་བྱིན་ཡིན། །སངས་རྒྱས་བློ་གྲོས་ཡུམ་ཡིན་སྲས་པོ་ནི། །མིག་མི་འཐུན་པ་ཟླ་བ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend ninety-two leagues. Gift of Excellence will be his father and Buddha Intelligence his mother. Dissimilar Eyes will be his son and Moon his attendant.

source: རབ་ཏུ་བརྒྱན་པའི་གཟི་བརྗིད་བློ་ལྡན་ཏེ། །
en: “Splendid Adornment will be the one of wisdom

source: རྣམ་པར་ངེས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Ascertainment the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་ཆགས་མེད་གཡོ་མེད་ང་མེད་པ། །འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་ནི་གསུམ་གསུམ་ཡོད། །
en: There will be eighty consecutive congregations, Each gathering six million three hundred thousand selfless ones, “Detached from the world and immutable.

source: མགོན་པོ་མཆོག་མ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་ནི་ལོ་གྲངས་སྟོང་དུ་གནས། །
en: And after this supreme protector has attained nirvāṇa His sacred Dharma will remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་རིལ་གཅིག་མཆོད་རྟེན་གཅིག །དཔག་ཚད་གསུམ་པ་རྒྱལ་མཚན་དག་གིས་བརྒྱན། །
en: “The relics of this victor will remain in a single collection, And there will be a single stūpa of three leagues, adorned with banners.

source: སངས་རྒྱས་མཚུངས་པ་མེད་པ་དཔལ་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་མཛེས་ཞེས་བྱ། །
en: The incomparable buddha Śrī Will be born in a place called Beautiful World.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གཅིག་ཡོད་ཡབ་ནི་མྱ་ངན་མེད། །སྡུག་དགའ་ཞེས་བྱ་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཚེར་མ་མེད་པ་དགའ་བ་རིམ་གྲོ་པ། །
en: “This victorious one will be of kṣatriya family, And his light will extend one league. Free from Suffering will be his father and Joyous Beauty his mother. Free from Thorns will be his son and Joy his attendant.

source: སྐྱེ་བོས་མཆོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Worshiped by the People will be the scholar

source: རྒོལ་བ་འཇོམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Defeater of Attacks the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཞི་བརྒྱ་བརྒྱད་ཅུ་སྟེ། །ཀུན་ལའང་འདམ་རྫབ་དྲ་བ་མུན་སྤངས་པ། །རྡུལ་བྲལ་སྲིད་ལས་གྲོལ་བ་ཤ་སྟག་འདུས། །
en: There will be four hundred eighty consecutive congregations, Each of them exclusively gathering immaculate ones who are liberated from existence “And have relinquished the mud, the net, and the darkness.

source: མི་ཚེ་ལོ་གྲངས་དག་ནི་བརྒྱ་ཡང་ཡིན། །
en: The lifespan of humans will be one hundred years,

source: མགོན་པོ་མཆོག་མ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་པའི་ཆོས་ནི་ལོ་གྲངས་བརྒྱད་ཅུར་གནས། །
en: And after this supreme protector has attained nirvāṇa His sacred Dharma will remain for eighty years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོ་དྲུག་ཁྲི་དྲུག་སྟོང་འབྱུང་། །
en: “The relics of this victor will be abundant, And there will be sixty-six thousand fine stūpas.

source: འཇིག་རྟེན་མཁྱེན་པ་ལེགས་པར་སྐྱེས་པ་ཡི། །སྐྱེས་པའི་ཡུལ་ནི་དེས་པ་ཞེས་ཀྱང་བྱ། །
en: The knower of the world, Sujāta, Will be born in a place called Gentle.

source: རྒྱལ་བ་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་བདུན་ཅུ་ཡབ་ནི་བདག་ཉིད་ཆེ། །འོད་སྐྱོང་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victorious one will be kṣatriya, And his light will extend seven hundred million leagues. Great Being will be his father, and Light Nourisher will be this victor’s mother.

source: སྲས་པོ་གློག་འོད་དྲག་ཤུལ་རིམ་གྲོ་པ། །
en: Flash of Lightning will be his son and Fierce his attendant.

source: སྐྱོན་སེལ་པ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Dispeller of Flaws the one of miracles.
